app/views/blogs/show.html.erb

SELECT COUNT(*) FROM `loves` WHERE `loves`.`blog_id` = 4
---
    <%= link_to blog_love_path(@blog), method: :delete do %>
        <i class="fas fa-heart red-heart"></i><span class="red-count"><%= @blog.loves.count %></span>

SELECT COUNT(*) FROM `loves` WHERE `loves`.`blog_id` = 5
---
    <%= link_to blog_loves_path(@blog), method: :post do %>
        <i class="fas fa-heart"></i><%= @blog.loves.count %>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
<div>
    <%= c.user.email unless c.user.blank? %>