app/views/users/show.html.erb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 3
---
<h2>あなたのおすすめ投稿一覧</h2>
<% @user.tweets.each do |t| %>

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`user_id` = 3
---
<h2>あなたの今日の筋トレ記録一覧</h2>
<% @user.blogs.each do |t| %>

SELECT `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 3
---
<h2>フォロー中のユーザー<h2>
<% @user.relationships.each do |t| %>