app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
    def index
        @blogs = Blog.all

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
    def show
        @blog = Blog.find(params[:id])

INSERT INTO `blogs` (`training`, `part`, `about`, `start_time`, `created_at`, `updated_at`) VALUES ('bgfvdc', '腹筋', 'fvdc', '2020-12-15 07:52:00', '2020-12-15 07:53:13.733361', '2020-12-15 07:53:13.733361')
---
    def create
        Blog.create(blog_parameter)

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 1
---
    def destroy
        @blog = Blog.find(params[:id])
        @blog.destroy

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 5 LIMIT 1
---
    def update
        @blog = Blog.find(params[:id])