app/controllers/comments_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
INSERT INTO `comments` (`content`, `user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES ('srdtfghjkl;', 5, 12, '2020-11-28 12:47:42.653238', '2020-11-28 12:47:42.653238')
---
    def create
      tweet = Tweet.find(params[:tweet_id])
      comment = tweet.comments.new(comment_params) #buildを使い、contentとtweet_idの二つを同時に代入
      comment.user_id = current_user.id
      if comment.save