app/controllers/fronts_controller.rb

SELECT `tweets`.* FROM `tweets` LIMIT 3 OFFSET 0
SELECT `blogs`.* FROM `blogs`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `graphs`.`weigh_on`, `graphs`.`weight` FROM `graphs`
---
    def show
        @tweets =Tweet.all.page(params[:page]).per(3)
        @blogs = Blog.all.order(created_at: :desc)
        @my_blogs = @blogs.select{ |blog| blog.user_id == current_user.id }
        @user = User.find(params[:id])
        @result = Graph.pluck(:weigh_on, :weight)