app/controllers/graphs_controller.rb

SELECT `graphs`.* FROM `graphs`
SELECT `graphs`.`weigh_on`, `graphs`.`weight` FROM `graphs`
---
    def index
        @graphs = Graph.all
        @result = Graph.pluck(:weigh_on, :weight)

INSERT INTO `graphs` (`weight`, `weigh_on`, `created_at`, `updated_at`, `user_id`) VALUES (65, '2020-12-18', '2020-12-18 09:55:42.625337', '2020-12-18 09:55:42.625337', 3)
---
    def create
        graph = Graph.new(graph_parameter)
        graph.user_id = current_user.id

        if graph.save

SELECT `graphs`.* FROM `graphs` WHERE `graphs`.`id` = 5 LIMIT 1
DELETE FROM `graphs` WHERE `graphs`.`id` = 5
---
    def destroy
        graph = Graph.find(params[:id])
        graph.destroy

SELECT `graphs`.* FROM `graphs` WHERE `graphs`.`id` = 5 LIMIT 1
---
    def edit
        @graph = Graph.find(params[:id])

SELECT `graphs`.* FROM `graphs` WHERE `graphs`.`id` = 6 LIMIT 1
UPDATE `graphs` SET `graphs`.`weight` = 56, `graphs`.`updated_at` = '2020-12-18 06:19:44.316349' WHERE `graphs`.`id` = 6
---
    def update
        graph = Graph.find(params[:id])
        if graph.update(graph_parameter)