app/controllers/likes_controller.rb

    def create
        like = current_user.likes.create(tweet_id: params[:tweet_id])
---
INSERT INTO `likes` (`tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES (12, 2, '2020-11-24 11:23:51.839012', '2020-11-24 11:23:51.839012')

      def destroy
        like = Like.find_by(tweet_id: params[:tweet_id], user_id: current_user.id)
        like.destroy
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`tweet_id` = 12 AND `likes`.`user_id` = 2 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1