app/controllers/loves_controller.rb

INSERT INTO `loves` (`blog_id`, `user_id`, `created_at`, `updated_at`) VALUES (4, 3, '2020-12-17 04:12:00.488864', '2020-12-17 04:12:00.488864')
---
    def create
        love = current_user.loves.create(blog_id: params[:blog_id])