app/controllers/messages_controller.rb

SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 7 AND `entries`.`room_id` = 1
INSERT INTO `messages` (`user_id`, `room_id`, `content`, `created_at`, `updated_at`) VALUES (7, 1, 'ｊｍｈんｇｂｆｖ', '2020-12-12 14:38:56.896706', '2020-12-12 14:38:56.896706')
---
    def create
      if Entry.where(:user_id => current_user.id, :room_id => params[:message][:room_id]).present?
        @message = Message.create(params.require(:message).permit(:user_id, :content, :room_id).merge(:user_id => current_user.id))