app/controllers/persons_controller.rb

SELECT `persons`.* FROM `persons`
---
    def index
        @person = Person.find_by(user_id:current_user.id)
        @persons = Person.all

SELECT `persons`.* FROM `persons` WHERE `persons`.`id` = 3 LIMIT 1
---
    def show
        @person = Person.find(params[:id])