app/controllers/persons_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
---
    def index

        @person = User.find(current_user.id)

INSERT INTO `persons` (`height`, `weight`, `created_at`, `updated_at`) VALUES (175, 63, '2020-12-21 01:29:43.725768', '2020-12-21 01:29:43.725768')
---
    def create
        person = Person.new(person_params)
        if person.save