app/controllers/relationships_controller.rb

  def show
    @my_user = User.find(params[id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1

  def set_user
    @user = User.find(params[:follow_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1