app/controllers/rooms_controller.rb

INSERT INTO `rooms` (`created_at`, `updated_at`) VALUES ('2020-12-12 14:38:49.661196', '2020-12-12 14:38:49.661196')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (7, 1, '2020-12-12 14:38:49.711061', '2020-12-12 14:38:49.711061')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (3, 1, '2020-12-12 14:38:49.754891', '2020-12-12 14:38:49.754891')
---
  def create
    @room = Room.create
    @entry1 = Entry.create(:room_id => @room.id, :user_id => current_user.id)
    @entry2 = Entry.create(params.require(:entry).permit(:user_id, :room_id).merge(:room_id => @room.id))

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 7 AND `entries`.`room_id` = 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1
---
  def show
    @user = User.find(params[:id])
    @room = Room.find(params[:id])
    if Entry.where(:user_id => current_user.id, :room_id => @room.id).present?
      @messages = @room.messages
      @message = Message.new
      @entries = @room.entries
      @my_entry = @entries.select{ |entry| entry.user_id == current_user.id}
      @other_entry = @entries.select{ |entry| entry.user_id != current_user.id}
      @my_message = @messages.select{ |message| message.user_id == current_user.id}