app/controllers/supports_controller.rb

    def create
        blog = Blog.find(params[:blog_id])
        support = blog.supports.new(support_params)
        support.user_id = current_user.id
      if support.save
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 13 LIMIT 1
INSERT INTO `supports` (`content`, `user_id`, `blog_id`, `created_at`, `updated_at`) VALUES ('gbfv', 3, 13, '2020-12-18 08:32:29.227150', '2020-12-18 08:32:29.227150')