app/controllers/tweets_controller.rb

SELECT COUNT(*) FROM (SELECT 1 AS one FROM `tweets` LIMIT 3 OFFSET 0) subquery_for_count
SELECT `tweets`.* FROM `tweets` LIMIT 3 OFFSET 0
---
    def index
        @tweets =Tweet.all.page(params[:page]).per(3)

INSERT INTO `tweets` (`name`, `training`, `part`, `about`, `created_at`, `updated_at`, `user_id`, `image`) VALUES ('bfdbtgrfd', 'rfds', 'rfeds', 'btrgfed', '2020-11-28 10:02:17.690200', '2020-11-28 10:02:17.690200', 5, 'gix6AARjjB8L9lbPWY0XseE242WBlFdZH4ysL4T2.jpeg')
---
    def create
        tweet = Tweet.new(tweet_params)
        tweet.user_id = current_user.id

        if tweet.save

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 19 LIMIT 1
---
    def update
        tweet = Tweet.find(params[:id])

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 8 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 15
---
    def destroy
        tweet = Tweet.find(params[:id])
        tweet.destroy