app/controllers/tweets_controller.rb

    def index
        @tweets =Tweet.all.page(params[:page]).per(5)
        @all_ranks = Tweet.find(Like.group(:tweet_id).order('count(tweet_id) desc').limit(5).pluck(:tweet_id))
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 12