app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (body LIKE '%りんご%' )
---
    def index
      @users = User.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 7
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 1
---
    def show
        @user = User.find(params[:id])
        @currentUserEntry=Entry.where(user_id: current_user.id)
        @userEntry=Entry.where(user_id: @user.id)
        if @user.id == current_user.id
        else
          @currentUserEntry.each do |cu|
            @userEntry.each do |u|