app/models/user.rb

          def already_liked?(tweet)
            self.likes.exists?(tweet_id: tweet.id)
---
SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 6 AND `likes`.`tweet_id` = 12 LIMIT 1