app/models/user.rb

          def already_liked?(tweet)
            self.likes.exists?(tweet_id: tweet.id)
---
SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 21 AND `likes`.`tweet_id` = 1 LIMIT 1

        def follow(other_user)
          unless self == other_user
              self.relationships.find_or_create_by(follow_id: other_user.id)
---
INSERT INTO `relationships` (`user_id`, `follow_id`, `created_at`, `updated_at`) VALUES (3, 8, '2020-12-14 07:33:05.389750', '2020-12-14 07:33:05.389750')
SELECT `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 3 AND `relationships`.`follow_id` = 8 LIMIT 1

        def unfollow(other_user)
          relationship = self.relationships.find_by(follow_id: other_user.id)
          relationship.destroy if relationship
---
DELETE FROM `relationships` WHERE `relationships`.`id` = 3

        def following?(other_user)
          self.followings.include?(other_user)
---
SELECT 1 AS one FROM `users` INNER JOIN `relationships` ON `users`.`id` = `relationships`.`follow_id` WHERE `relationships`.`user_id` = 3 AND `users`.`id` = 8 LIMIT 1

        def already_loved?(blog)
          self.loves.exists?(blog_id: blog.id)
---
SELECT 1 AS one FROM `loves` WHERE `loves`.`user_id` = 3 AND `loves`.`blog_id` = 13 LIMIT 1